#########################################################################
# File Name: shell_color.sh
# Author: andrew Choe
# mail: xgod@163.com
# Created Time: Tue 22 Aug 2017 10:57:04 AM CST
#########################################################################
#!/bin/bash
#
# man console_codes  
#参数值  结果 
#0  重设所有属性到缺省设置 
#1  设置粗体 
#2  设置一半亮度 
#4  设置下划线 
#5  设置闪烁 
#7  设置反向图象 
#8  不可见 
#9  设置删除文字效果 
#30  设置黑色前景 
#31  设置红色前景 
#32  设置绿色前景 
#33  设置棕色前景 
#34  设置蓝色前景 
#35  设置紫色前景 
#36  设置青色前景 
#37  设置白色前景 

#40  设置黑色背景 
#41  设置红色背景 
#42  设置绿色背景 
#43  设置棕色背景 
#44  设置蓝色背景 
#45  设置紫色背景 
#46  设置青色背景 
#47  设置白色背景 
for i in {40..47};do
    echo =========backgroundcolor:$i=========== 
    for j in {30..37};do

    echo  back.. $i: fore..:$j 
        for k in 1 2 4 5 7 8 9 ;do
            echo -e "\e[${i};${j};${k}m hello world. $i:$j:$k \e[0m"
        done
        printf "\n\n"
    done
    printf "\n\n"
done |more
